{"nodes":[{"title":"category-theory","slug":"__category-theory","shortSummary":"Category Theorya new and fundamental insight about the nature of mathematics.a category = mathematical universeingredients = objects, maps, composition of maps'A general theory of natural equivalences’ Eilenberg and Mac LaneSpatially, think about the resolution of vectors in space.For Gallelio to"},{"title":"graph-isomorphism","slug":"__graph-isomorphism","shortSummary":"Key Concepts[]Unfamiliar Terms[]"},{"title":"index","slug":"__index","shortSummary":"Summer 2025 — Ongoing Work & WonderingsThis notebook is where I’m keeping track of the things I’m working on and thinking through this summer — slowly, steadily, and mostly because I enjoy it.Right now, I’m mainly focused on:Graph Isomorphism –"},{"title":"poems","slug":"__poems","shortSummary":"What happened?How do I explain a sliver of colossal structuresCollapsing, Cascading, tumultuous —Like a rotten gum in a toddler’s mouthScintillating, Suffocating, veinous —Each root shivers alerting the crown,Begging to be pulled out.It knows of only one end beyond the pain"},{"title":"proofs-and-refutations-lakatos","slug":"__proofs-and-refutations-lakatos","shortSummary":"The Logic of Mathematical Discovery\"Nobody will doubt that some problems about a mathematical theory can only be approached once it has been formalized, just as some problems about human beings (say concerning their anatomy) can only be approached after their"},{"title":"quant","slug":"__quant","shortSummary":""},{"title":"topology","slug":"__topology","shortSummary":"Topology - my thoughtsA large part of mathematics is to see and make generalizations. Topology and the agreed upon definition of it make such a generalization about \"open\" sets in the Real number space. We have the idea of an"}],"edges":[{"source":"__index","target":"__graph-isomorphism"},{"source":"__index","target":"__quant"},{"source":"__index","target":"__category-theory"},{"source":"__index","target":"__topology"},{"source":"__index","target":"__proofs-and-refutations-lakatos"},{"source":"__index","target":"__poems"}]}